# Выведите на экран построчно числа от 58 до 50 включительно,
# используя цикл while

start = 58
end = 50

while start >= end:
    print(start)
    start -= 1